In [1]:
%load_ext sql

In [2]:
%sql sqlite:///chinook.db

__List each employee's first and last name along with their boss's first and last name__

In [55]:
%%sql
SELECT e.firstname || ' ' ||  e.lastname AS workers
, m.firstname || ' ' || m.lastname AS boss
FROM employees AS e 
LEFT JOIN employees AS m 
    ON m.employeeid = e.reportsto

 * sqlite:///chinook.db
Done.

[('Andrew Adams', None),
 ('Nancy Edwards', 'Andrew Adams'),
 ('Jane Peacock', 'Nancy Edwards'),
 ('Margaret Park', 'Nancy Edwards'),
 ('Steve Johnson', 'Nancy Edwards'),
 ('Michael Mitchell', 'Andrew Adams'),
 ('Robert King', 'Michael Mitchell'),
 ('Laura Callahan', 'Michael Mitchell')]

__Name employee and boss who are in different city__

In [92]:
%%sql
SELECT e.firstname AS employee 
, m.firstname AS boss 
, e.city AS emp_city 
, m.city AS boss_city
FROM employees AS e 
JOIN employees AS m 
    ON e.reportsto = m.employeeid 
WHERE e.city <> m.city

 * sqlite:///chinook.db
Done.

[('Nancy', 'Andrew', 'Calgary', 'Edmonton'),
 ('Michael', 'Andrew', 'Calgary', 'Edmonton'),
 ('Robert', 'Michael', 'Lethbridge', 'Calgary'),
 ('Laura', 'Michael', 'Lethbridge', 'Calgary')]

__Find managers who have at least 2 employees directly reporting to them__

In [42]:
%%sql 
SELECT m.firstname, m.lastname 
FROM employees AS m  
JOIN employees AS e
    ON e.reportsto = m.employeeid
GROUP BY e.reportsto
HAVING COUNT(m.employeeid) >= 2

 * sqlite:///chinook.db
Done.

[('Andrew', 'Adams'), ('Nancy', 'Edwards'), ('Michael', 'Mitchell')]

__Name the employee who were hired before their boss__

In [86]:
%%sql 
SELECT e.firstname AS employee 
, STRFTIME('%Y.%m', e.hiredate) AS emp_hire_date 
, STRFTIME('%Y-%m', m.hiredate) AS boss_hire_date
FROM employees AS e
LEFT JOIN employees AS m 
    ON e.reportsto = m.employeeid 
GROUP BY e.reportsto 
HAVING e.hiredate < m.hiredate

 * sqlite:///chinook.db
Done.

[('Nancy', '2002.05', '2002-08'), ('Jane', '2002.04', '2002-05')]

__Name the employee whose at least one direct reportee is older than them__

In [73]:
%%sql
SELECT m.firstname AS boss
, e.firstname AS oldest_reportee 
, STRFTIME('%Y', m.birthdate) AS manager_birthdate 
, MAX(STRFTIME('%Y', e.birthdate)) AS oldest_reportee_birthdate
FROM employees AS m  
JOIN employees AS e 
    ON e.reportsto = m.employeeid 
GROUP BY e.reportsto
HAVING m.birthdate > (e.birthdate)

 * sqlite:///chinook.db
Done.

[('Michael', 'Robert', '1973', '1970')]

In [93]:
%%sql
select * from customers limit 10

 * sqlite:///chinook.db
Done.

[(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3),
 (2, 'Leonie', 'Köhler', None, 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', '+49 0711 2842222', None, 'leonekohler@surfeu.de', 5),
 (3, 'François', 'Tremblay', None, '1498 rue Bélanger', 'Montréal', 'QC', 'Canada', 'H2G 1A7', '+1 (514) 721-4711', None, 'ftremblay@gmail.com', 3),
 (4, 'Bjørn', 'Hansen', None, 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', '+47 22 44 22 22', None, 'bjorn.hansen@yahoo.no', 4),
 (5, 'František', 'Wichterlová', 'JetBrains s.r.o.', 'Klanova 9/506', 'Prague', None, 'Czech Republic', '14700', '+420 2 4172 5555', '+420 2 4172 5555', 'frantisekw@jetbrains.com', 4),
 (6, 'Helena', 'Holý', None, 'Rilská 3174/6', 'Prague', None, 'Czech Republic', '14300', '+420 2 4177 0449', None, 'hholy@gmail.com', 5),
 (7, 'Astrid', 'Gruber', None, 'Rotenturmstraße 4, 1010 Innere Stadt', 'Vienne', None, 'Austria', '1010', '+43 01 5134505', None, 'astrid.gruber@apple.at', 5),
 (8, 'Daan', 'Peeters', None, 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', '+32 02 219 03 03', None, 'daan_peeters@apple.be', 4),
 (9, 'Kara', 'Nielsen', None, 'Sønder Boulevard 51', 'Copenhagen', None, 'Denmark', '1720', '+453 3331 9991', None, 'kara.nielsen@jubii.dk', 4),
 (10, 'Eduardo', 'Martins', 'Woodstock Discos', 'Rua Dr. Falcão Filho, 155', 'São Paulo', 'SP', 'Brazil', '01007-010', '+55 (11) 3033-5446', '+55 (11) 3033-4564', 'eduardo@woodstock.com.br', 4)]

__Write the manager name and total number of customer supported by their direct report__

In [94]:
%%sql
SELECT m.firstname AS boss 
, COUNT(c.customerid)
FROM employees AS e 
JOIN employees AS m 
    ON e.reportsto = m.employeeid 
JOIN customers AS c 
    ON c.supportrepid = e.employeeid 
GROUP BY e.reportsto

 * sqlite:///chinook.db
Done.

[('Nancy', 59)]

__Show that only Nancy's direct reports deal with customers__

In [97]:
%%sql
SELECT DISTINCT m.firstname
FROM employees AS e 
JOIN employees AS m 
    ON e.reportsto = m.employeeid 
WHERE e.employeeid IN (
    SELECT DISTINCT supportrepid FROM customers
)

 * sqlite:///chinook.db
Done.

[('Nancy',)]